uat_chat/Documents/уатОперацииСТехническимиЖидкостями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатОперацииСТехническимиЖидкостями</Name>
			<Comment>(уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходТехническихЖидкостей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийСТехническимиЖидкостями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехническиеЖидкости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатПартииТоваровНаСкладах</Name>
			<Comment>Партии товаров на складах  (уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Comment>Стоимость в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОперацииСТехническимиЖидкостями</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСливГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Enums/уатВидыОперацийСТехническимиЖидкостями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийСТехническимиЖидкостями</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоливПоАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоливПоТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоливПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Documents/уатОперацииСТехническимиЖидкостями/Ext/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ВестиСкладскойУчетУАТ)
		И (ДокументСсылка.ВидОперации <> Перечисления.уатВидыОперацийСТехническимиЖидкостями.РасходПрочее) Тогда
		СформироватьТаблицаПартий(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
	СформироватьТаблицаРасходТЖ(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПартий(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка.Склад КАК Склад,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаДокументаНоменклатура
	|ИЗ
	|	Документ.уатОперацииСТехническимиЖидкостями.ТехническиеЖидкости КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО ТаблицаДокумента.Номенклатура = уатНоменклатураГСМ.Номенклатура
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.Ссылка.Склад";
	
	Если уатРаботаСМетаданными.естьСпрЕдиницыИзмерения() тогда
		СтрокаПоиска  = "ТаблицаДокумента.Количество";
		СтрокаЗамены  = "ВЫРАЗИТЬ(ТаблицаДокумента.Количество * ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент / ТаблицаДокумента.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Число(15,3))";
		мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст,СтрокаПоиска,СтрокаЗамены);
	КонецЕсли;
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Выборка = мЗапрос.Выполнить();
	
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабНоменклатуры.Склад,
	|	ТабНоменклатуры.Номенклатура,
	|	ТабНоменклатуры.Количество
	|ИЗ 
	|	ТаблицаДокументаНоменклатура КАК ТабНоменклатуры";
	
	ТаблицаПартий = уатПроведение.ПолучитьТаблицуПартийДляСписания(мЗапрос.Выполнить().Выгрузить(),
		уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.СпособОценкиМПЗ), СтруктураДополнительныеСвойства.ДляПроведения.МоментКонтроля);
	
	ЗапросПартии = Новый Запрос();
	ЗапросПартии.Текст = 
	"ВЫБРАТЬ
	|	ТабДанных.Склад,
	|	ТабДанных.Номенклатура,
	|	ТабДанных.Партия,
	|	ТабДанных.Количество,
	|	ТабДанных.Стоимость,
	|	ТабДанных.СтоимостьУпр
	|ПОМЕСТИТЬ ВремТаблицаПартий
	|ИЗ
	|	&ТаблицаПарам КАК ТабДанных
	|;
	|ВЫБРАТЬ
	|	&ВидДвижения КАК ВидДвижения,
	|	&Период,
	|	&Регистратор,
	|	ТабДанных.Склад КАК Склад,
	|	" + ?(ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.Слив, "&Регистратор", "ТабДанных.Партия") + " КАК Партия,
	|	ТабДанных.Номенклатура,
	|	ТабДанных.Количество,
	|	ТабДанных.Стоимость,
	|	ТабДанных.СтоимостьУпр
	|ИЗ ВремТаблицаПартий КАК ТабДанных";
	
	ЗапросПартии.УстановитьПараметр("Период"         , ДокументСсылка.Дата);
	ЗапросПартии.УстановитьПараметр("ТаблицаПарам"   , ТаблицаПартий);
	ЗапросПартии.УстановитьПараметр("Регистратор"    , ДокументСсылка);
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.Слив Тогда
		ЗапросПартии.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Иначе
		ЗапросПартии.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	КонецЕсли;
		
	МассивРезультатов = ЗапросПартии.ВыполнитьПакет();
	ТаблицаДокумента = МассивРезультатов[1].Выгрузить();
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатПартииТоваровНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаДокумента;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартии", ТаблицаДокумента);
	
КонецПроцедуры // СформироватьТаблицаПартий()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасходТЖ(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблДвижений = Новый ТаблицаЗначений;
	тблДвижений.Колонки.Добавить("Период");
	тблДвижений.Колонки.Добавить("ТС");
	тблДвижений.Колонки.Добавить("Водитель");
	тблДвижений.Колонки.Добавить("ГСМ");
	тблДвижений.Колонки.Добавить("Колонна");
	тблДвижений.Колонки.Добавить("Организация");
	тблДвижений.Колонки.Добавить("ВидОперации");
	тблДвижений.Колонки.Добавить("КоличествоПриход");
	тблДвижений.Колонки.Добавить("КоличествоРасход");
	
	ЭтоПриходТЖ = (ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПоАкту
		ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПоТО
		ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПрочее);
		
	флЕстьЕИ = уатРаботаСМетаданными.естьСпрЕдиницыИзмерения();
	
	Для Каждого ТекСтрокаТЖ Из ДокументСсылка.ТехническиеЖидкости Цикл
		Если ТекСтрокаТЖ.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекКолоннаТС = уатОбщегоНазначения.уатПрочитатьРеквизитыТС(ТекСтрокаТЖ.ТС, "Колонна", ДокументСсылка.Дата).Колонна;
		
		НоваяСтрока = тблДвижений.Добавить();
		НоваяСтрока.Период = ДокументСсылка.Дата;
		НоваяСтрока.ВидОперации = ДокументСсылка.ВидОперации;
		НоваяСтрока.ТС = ТекСтрокаТЖ.ТС;
		НоваяСтрока.Водитель = ТекСтрокаТЖ.Водитель;
		НоваяСтрока.ГСМ = ТекСтрокаТЖ.Номенклатура;
		НоваяСтрока.Колонна = ТекКолоннаТС;
		НоваяСтрока.Организация = ДокументСсылка.Организация;
		Если ЭтоПриходТЖ Тогда
			Если флЕстьЕИ Тогда
				НоваяСтрока.КоличествоПриход = ТекСтрокаТЖ.Количество*ТекСтрокаТЖ.ЕдиницаИзмерения.Коэффициент;
			Иначе
				НоваяСтрока.КоличествоПриход = ТекСтрокаТЖ.Количество;
			КонецЕсли;
		Иначе
			Если флЕстьЕИ Тогда
				НоваяСтрока.КоличествоРасход = ТекСтрокаТЖ.Количество*ТекСтрокаТЖ.ЕдиницаИзмерения.Коэффициент;
			Иначе
				НоваяСтрока.КоличествоРасход = ТекСтрокаТЖ.Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	тблДвижений.Свернуть("Период, ТС, Водитель, ГСМ, Колонна, Организация, ВидОперации", "КоличествоПриход, КоличествоРасход");
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходТЖ", тблДвижений);
КонецПроцедуры // СформироватьТаблицаРасходГСМ()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ВестиСкладскойУчетУАТ) И
		(ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПоАкту ИЛИ
		ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПоТО ИЛИ
		ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПрочее) Тогда
		
		Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
		
		тблЗаправки = ДокументСсылка.ТехническиеЖидкости.Выгрузить();
		
		мсвНоменклатура = Новый Массив;
		Для Каждого ТекСтрока Из тблЗаправки Цикл
			мсвНоменклатура.Добавить(ТекСтрока.Номенклатура);
		КонецЦикла;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	уатПартииТоваровНаСкладах.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(уатПартииТоваровНаСкладах.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.уатПартииТоваровНаСкладах.Остатки(&МоментКонтроля, Склад = &Склад И Номенклатура В(&Номенклатура)) КАК уатПартииТоваровНаСкладах
		|ГДЕ
		|	ЕСТЬNULL(уатПартииТоваровНаСкладах.КоличествоОстаток, 0) < 0");
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Запрос.УстановитьПараметр("Номенклатура", мсвНоменклатура);
		Запрос.УстановитьПараметр("Склад", ДокументСсылка.Склад);
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			ТекстСообщения = "Номенклатура """ + Рез.Номенклатура + """, Склад """ + ДокументСсылка.Склад + """ ";
			ТекстСообщения = ТекстСообщения + " - отрицательный остаток Номенклатуры на Складе.";
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Остаток на складе: " + Рез.КоличествоОстаток + ".";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
